//=====================================
//
//ボスUIマネージャ処理[BossUIManager.cpp]
//Author:GP12A332 21 立花雄太
//
//=====================================
#include "BossUIManager.h"
#include "WarningUI.h"

/**************************************
マクロ定義
***************************************/

/**************************************
コンストラクタ
***************************************/
BossUImanager::BossUImanager()
{
	warning = new WarningUI();
}

/**************************************
デストラクタ
***************************************/
BossUImanager::~BossUImanager()
{
	SAFE_DELETE(warning);
}

/**************************************
更新処理
***************************************/
void BossUImanager::Update()
{
	warning->Update();
}

/**************************************
描画処理
***************************************/
void BossUImanager::Draw()
{
	warning->Draw();
}

/**************************************
ワーニングセット処理
***************************************/
void BossUImanager::SetWarning()
{
	warning->StartFade(true);
}
