//=====================================
//
//コリジョンマネージャヘッダ[CollisionManager.h]
//Author:GP12B332 21 立花雄太
//
//=====================================
#ifndef _COLLISIONMANAGER_H_
#define _COLLISIONMANAGER_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
クラス定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void UpdateCollisionManager(void);

#endif