//=====================================
//
//エディタシーン処理[EditorScene.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "EditorScene.h"
#include "EditorBG.h"
#include "StageEditor.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void EditorScene::Init()
{
	//インスタンス作成
	bg = new EditorBG();
	editor = new StageEditor();
}

/**************************************
終了処理
***************************************/
void EditorScene::Uninit()
{

	//インスタンス破棄
	SAFE_DELETE(bg);
	SAFE_DELETE(editor);
}

/**************************************
更新処理
***************************************/
void EditorScene::Update(HWND hWnd)
{
	bg->Update();
}

/**************************************
描画処理
***************************************/
void EditorScene::Draw()
{
	//bg->Draw();
	editor->Draw();
}