//=====================================
//
//エネミー処理のメンバー関数の実装[EnemyController.cpp]
//Author:馬　前程
//
//=====================================
#include "EnemyController.h"

/**************************************
マクロ定義
***************************************/


/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/
int Enemy::objNum = 0;


/**************************************
更新処理
***************************************/
void EnemyStraight::Update(HWND hWnd)
{

}

void EnemyFlat::Update(HWND hWnd)
{

}

/**************************************
描画処理
***************************************/
void EnemyStraight::Draw(void)
{

}

void EnemyFlat::Draw(void)
{

}

/**************************************
初期化処理
***************************************/
void EnemyStraight::Init(void)
{

}

void EnemyFlat::Init(void)
{

}

/**************************************
終了処理
***************************************/
void EnemyStraight::Uninit(Enemy *enemy)
{
	delete enemy;

}

void EnemyFlat::Uninit(Enemy *enemy)
{
	delete enemy;

}

/**************************************
コンストラクタ
***************************************/
EnemyStraight::EnemyStraight()
{

}

EnemyFlat::EnemyFlat()
{

}

Enemy::Enemy()
{
	//オブジェクトをカウントする
	objNum++;
}
/**************************************
デストラクタ
***************************************/
EnemyStraight::~EnemyStraight()
{

}

EnemyFlat::~EnemyFlat()
{

}

Enemy::~Enemy()
{

}