//=====================================
//
//ゲームスタート処理[GameStart.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "GameStart.h"

/**************************************
マクロ定義
***************************************/

/**************************************
入場処理
***************************************/
void GameStart::OnStart(GameScene *entity)
{
	entity->cntFrame = 0;
}

/**************************************
更新処理
***************************************/
int GameStart::OnUpdate(GameScene *entity)
{
	entity->cntFrame++;
}