//=====================================
//
//ゲームシーン処理[GameScene.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "GameScene.h"
#include "debugWindow.h"
#include "Game.h"

#include "BackGroundCity.h"
#include "SkyBox.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void GameScene::Init()
{
	//InitBackGroundCity(0);
	InitSkyBox(0);
}

/**************************************
終了処理
***************************************/
void GameScene::Uninit()
{
	//UninitBackGroundCity(0);
	UninitSkyBox(0);
}

/**************************************
更新処理
***************************************/
void GameScene::Update()
{
	//UpdateBackGroundCity();
	UpdateSkyBox();
}

/**************************************
描画処理
***************************************/
void GameScene::Draw()
{
	//DrawBackGroundCity();
	DrawSkyBox();
}