//=====================================
//
//待機処理[PlayerWait.cpp]
//Author:GP12B332 12 権頭
//
//=====================================
#include "PlayerWait.h"

/**************************************
マクロ定義
***************************************/
#define PLAYERWAIT_DURATION		(180)

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/


/*************************************
更新処理
**************************************/
void PlayerWait::OnUpdate(Player *entity)
{
	entity->cntFrame++;

	if (entity->cntFrame == PLAYERWAIT_DURATION)
		OnExit(entity);
}

/*************************************
入場処理
**************************************/
void PlayerWait::OnStart(Player *entity)
{
	entity->cntFrame = 0;
}

/*************************************
退場処理
**************************************/
void PlayerWait::OnExit(Player *entity)
{
	if (callback != NULL)
		callback();
}
