//=====================================
//
//リザルトシーン処理[ResultScene.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "ResultScene.h"
#include "debugWindow.h"
#include "Game.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void ResultScene::Init()
{

}

/**************************************
終了処理
***************************************/
void ResultScene::Uninit()
{

}

/**************************************
更新処理
***************************************/
void ResultScene::Update()
{
	static int cntFrame = 0;
	cntFrame++;
	if (cntFrame == 60)
	{
		cntFrame = 0;
		ChangeScene(SceneTitle);
	}
}

/**************************************
描画処理
***************************************/
void ResultScene::Draw()
{
	BeginDebugWindow("Scene");
	DebugText("Result Scene now");
	EndDebugWindow("Scene");
}