//=============================================================================
//
// リザルト背景画面処理 [resultBGUI.h]
// Author : 渡邉良則
//
//=============================================================================
#ifndef _RESULTBGUI_H_
#define _RESULTBGUI_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	ADRESS_TEXTURE_RESULTBG	("data/TEXTURE/UI/Result/ブラック.jpg")	// 読み込むテクスチャファイル名

#include "ResultSceneUIManager.h"

#include "UIdrawer.h"

class Object;

/**************************************
前方宣言
***************************************/
class ResultSceneUI;

//*****************************************************************************
// 構造体定義
//*****************************************************************************
class ResultBG :public Object
{
public:
	Object * object;
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
};

#endif
