//=====================================
//
//リザルトシーン処理[ResultScene.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "ResultScene.h"
#include "debugWindow.h"
#include "Game.h"
#include "ResultSceneUIManager.h"


/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void ResultScene::Init()
{
	InitResultSceneUI();

}

/**************************************
終了処理
***************************************/
void ResultScene::Uninit()
{
	UninitResultSceneUI();
}

/**************************************
更新処理
***************************************/
void ResultScene::Update(HWND hWnd)
{
	UpdateResultSceneUI(hWnd);
}

/**************************************
描画処理
***************************************/
void ResultScene::Draw()
{
	DrawResultSceneUI();
}