//=====================================
//
//スカイボックスヘッダ[SkyBox.h]
//Author:GP12B332 21 立花雄太
//
//=====================================
#ifndef _SKYBOX_H_
#define _SKYBOX_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
クラス定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitSkyBox(int num);
void UninitSkyBox(int num);
void UpdateSkyBox(void);
void DrawSkyBox(void);

#endif