//=====================================
//
//タイトルシーン処理[TitleScene.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "TitleScene.h"
#include "debugWindow.h"
#include "Game.h"
#include "InputController.h"
#include "masktex.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
初期化処理
***************************************/
void TitleScene::Init()
{

	InitMask(MASK_SIZE, MASK_SIZE,0);
}

/**************************************
終了処理
***************************************/
void TitleScene::Uninit()
{
	UninitMask();
}

/**************************************
更新処理
***************************************/
void TitleScene::Update(HWND hWnd)
{
	MaskFadeOut();
}

/**************************************
描画処理
***************************************/
void TitleScene::Draw()
{
	//マスクセット
	DrawMaskTexSet();

	//この間にタイトル描画

	//マスク終了
	DrawMaskTexEnd();

}