//=============================================================================
//
// タイトルロゴ画面処理 [titleLogoUI.h]
// Author : Yu Oohama (bnban987@gmail.com)
//
//=============================================================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	ADRESS_TEXTURE_TITLELOGO	("data/TEXTURE/UI/チームロゴ.png")	// 読み込むテクスチャファイル名

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleLogo(void);
void	UninitTitleLogo(void);
void	UpdateTitleLogo(void);
void	DrawTitleLogo(void);

#endif

