//=============================================================================
//
// タイトル背景画面処理 [titleBGUI.h]
// Author : Yu Oohama (bnban987@gmail.com)
//
//=============================================================================
#ifndef _TITLEBG_H_
#define _TITLEBG_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	ADRESS_TEXTURE_TITLEBG	("data/TEXTURE/UI/title_test.jpg")	// 読み込むテクスチャファイル名

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitleBG(void);
void	UninitTitleBG(void);
void	UpdateTitleBG(void);
void	DrawTitleBG(void);

#endif