//=====================================
//
//ベースオブザーバーヘッダ[BaseObserver.h]
//Author:GP12B332 21 立花雄太
//
//=====================================
#ifndef _BASEOBSERVER_H_
#define _BASEOBSERVER_H_

/**************************************
マクロ定義
***************************************/

/**************************************
クラス定義
***************************************/

/**************************************
BaseObserverクラス
継承先でvoid OnNotified()を定義する
***************************************/
class BaseObserver
{
public:
	virtual void OnNotified() = 0;
};

#endif