//=====================================
//
//ベースパーティクル処理[BaseParticle.cpp]
//Author:GP12B332 21 立花雄太
//
//=====================================
#include "BaseParticle.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
コンストラクタ
***************************************/
BaseParticle::BaseParticle()
{
	transform.pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	transform.IdentifyRotation();
	transform.scale = D3DXVECTOR3(1.0f, 1.0f, 1.0f);

	uv.u = uv.v = 0.0f;
	active = false;
}

/**************************************
デストラクタ
***************************************/
BaseParticle::~BaseParticle()
{
}

/**************************************
終了処理
***************************************/
void BaseParticle::Uninit()
{
	active = false;
}

/**************************************
トランスフォーム情報埋め込み処理
***************************************/
void BaseParticle::EmbedTransform(Transform *pTransform)
{
	*pTransform = transform;
	pTransform++;
}